Tekla Open API Reference for Tekla Structures 2025
Matrix Methods
The Matrix type exposes the following members.
Methods
Name | Description
GetTranspose
 Returns a new matrix which is a transpose of the current matrix. The transposed matrix is an inversion of the current matrix, if the current matrix was a valid rotation matrix.
ToString
 Returns a string that represents the current matrix.
 (Overrides Object.ToString().)
Transform(IEnumerable<Point>)
 Transforms the given points using the current matrix.
Transform(Point)
 Transforms the given point using the current matrix.
Transpose
 Transposes a matrix. The resulting matrix is an inversion of the current matrix, if the current matrix was a valid rotation matrix.
Top
See Also
Reference
Matrix Class
Tekla.Structures.Geometry3d Namespace